family-rewards-backend/app/controllers/actions_controller.rb

INSERT INTO "actions" ("price_id", "timestamp", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["price_id", 3], ["timestamp", "2021-05-08 02:07:17.474000"], ["created_at", "2021-05-08 02:07:17.688621"], ["updated_at", "2021-05-08 02:07:17.688621"]]
---
    def create
      action = Action.new(action_params)
      if action.save

SELECT "actions".* FROM "actions" WHERE "actions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "actions" WHERE "actions"."id" = ?  [["id", 2]]
---
    def destroy
        action = Action.find_by(id: params[:id])
        action.destroy