family-rewards-backend/app/controllers/prices_controller.rb

SELECT "prices".* FROM "prices"
---
    def index
      render json: Price.all, include: [actions: {only: [:timestamp, :id, :price_id]}], except: [:created_at, :updated_at]

INSERT INTO "prices" ("description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Go to sleep early"], ["price", 1.0], ["created_at", "2021-05-08 02:40:10.040293"], ["updated_at", "2021-05-08 02:40:10.040293"]]
---
    def create
      price = Price.new(price_params)
      if price.save

SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "prices" SET "description" = ?, "updated_at" = ? WHERE "prices"."id" = ?  [["description", "ff"], ["updated_at", "2021-05-13 05:43:06.790856"], ["id", 1]]
---
    def update
      price = Price.find_by(id: params[:id])
      price.update(price_params)

SELECT "prices".* FROM "prices" WHERE "prices"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "prices" WHERE "prices"."id" = ?  [["id", 6]]
---
    def destroy
      price = Price.find_by(id: params[:id])
      price.destroy